InformationRegisters/ЗадачиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадачСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗадачиСотрудников/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.Дата) = Ложь
		И ЗначениеЗаполнено(Запись.Время) = Ложь
		И ЗначениеЗаполнено(Запись.Сотрудник) = Ложь Тогда 
		Запись.Дата = ТекущаяДата();
		Запись.Время = ТекущаяДата();
		Запись.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ЭтаФорма.РольРКЦ = РольДоступна("РКЦ");
	ЭтаФорма.РольАБД = РольДоступна("АБД");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Проверить доступность служебных функций
	ПриОткрытииНаСервере();
	Если ЭтаФорма.РольРКЦ = Истина ИЛИ ЭтаФорма.РольАБД = Истина Тогда
		ЭтаФорма.Элементы.Время.ТолькоПросмотр = Ложь;
	КонецЕсли;
	ПодключитьОбработчикОжидания("ОбновитьВремя", 1);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ЭтаФорма.Запись.ТипЗадачи) = Ложь Тогда
		Предупреждение("Не задан тип задачи!",,"Ошибка создания задачи");
		Отказ = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Запись.Состояние) = Ложь Тогда
		Предупреждение("Не задано состояние задачи!",,"Ошибка создания задачи");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВремя()
	Если ЗначениеЗаполнено(ЭтаФорма.ЭтотОбъект.Запись.Состояние) = Ложь Тогда
		Запись.Время = ТекущаяДата();
	КонецЕсли
КонецПроцедуры
